# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.25, 1024] # summary: 208 layers, 832548 parameters, 15.8 GFLOPs
  m: [0.33, 0.50, 1024] # summary: 208 layers, 1679140 parameters, 24.6 GFLOPs
  l: [0.67, 0.75, 768] # summary: 208 layers, 4816804 parameters, 64.6 GFLOPs
  x: [1.00, 0.75, 512] # summary: 208 layers, 10513956 parameters, 135.9 GFLOPs

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [256, 3, 2]] # 0-P1/2
  - [-1, 1, DWConv, [256, 3, 2]] # 1-P2/4

  - [-1, 3, SWBlock, [256, True]]
  - [-1, 1, DWConv, [256, 3, 2]] # 3-P3/8

  - [-1, 6, SWBlock, [256, True]]
  - [-1, 1, DWConv, [256, 3, 2]] # 5-P4/16

  - [-1, 6, SWBlock, [512, True]]
  - [-1, 1, DWConv, [512, 3, 2]] # 7-P5/32

  - [-1, 3, SWBlock, [512, True]]
  - [-1, 1, DWConv, [512, 3, 1]] # 10-P5/32

# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, SWBlock, [512]] # 13 (P4/16-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, SWBlock, [256]] # 15 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 3, SWBlock, [256]] # 18 (P2/4-xsmall)

  - [[15, 18], 1, Detect, [nc]] # Detect(P2, P3, P4)
