# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 0.5, 768] # summary: 208 layers, 4816804 parameters, 64.6 GFLOPs

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [512, 3, 2]] # 0-P1/2
  - [-1, 1, DWConv, [512, 3, 1]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, DWConv, [256, 3, 1]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, DWConv, [256, 3, 1]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, DWConv, [256, 3, 1]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, DWConv, [256, 3, 2]] # 9-P2/4
  - [-1, 1, SWBlock, [256]]
  - [-1, 1, SWBlock, [256]]

  - [-1, 1, DWConv, [256, 3, 2]] # 12-P3/8
  - [-1, 1, SWBlock, [256]]
  - [-1, 1, SWBlock, [256]]

  - [-1, 1, DWConv, [256, 3, 2]] # 15-P4/16
  - [-1, 1, SWBlock, [512]]
  - [-1, 1, SWBlock, [512]]
  - [-1, 1, SWBlock, [512]]

# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 14], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, SWBlock, [256]] # 21 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 11], 1, Concat, [1]] # cat backbone P2
  - [-1, 1, SWBlock, [256]] # 24 (P2/4-xsmall)

  - [[21, 24], 1, Detect, [nc]] # Detect(P2, P3, P4)
