# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.25, 1024] # summary: 208 layers, 832548 parameters, 15.8 GFLOPs
  m: [0.33, 0.50, 1024] # summary: 208 layers, 1679140 parameters, 24.6 GFLOPs
  l: [0.67, 0.75, 768] # summary: 208 layers, 4816804 parameters, 64.6 GFLOPs
  x: [1.00, 0.75, 512] # summary: 208 layers, 10513956 parameters, 135.9 GFLOPs

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [512, 3, 2]] # 0-P1/2
  - [-1, 1, DWConv, [512, 3, 1]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, DWConv, [256, 3, 1]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, DWConv, [256, 3, 2]] # 5-P2/4
  - [-1, 1, SWBlock, [256]]

  - [-1, 1, DWConv, [256, 3, 2]] # 7-P3/8
  - [-1, 1, SWBlock, [256]]

  - [-1, 1, DWConv, [256, 3, 2]] # 9-P4/16
  - [-1, 1, SWBlock, [512]]
  - [-1, 1, SWBlock, [512]]

# YOLOv8.0-p2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, SWBlock, [256]] # 13 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P2
  - [-1, 1, SWBlock, [256]] # 16 (P2/4-xsmall)

  - [[14, 17], 1, Detect, [nc]] # Detect(P2, P3, P4)
